In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A -0.080292 -0.820230  0.090849 -1.653505
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515
E -1.083794 -0.056154 -0.712756  0.796913

In [5]:
df['W'] # lebih direkomendasi

A   -0.080292
B    0.526817
C    0.126391
D    0.112413
E   -1.083794
Name: W, dtype: float64

In [6]:
df.W

A   -0.080292
B    0.526817
C    0.126391
D    0.112413
E   -1.083794
Name: W, dtype: float64

In [7]:
df[['W','X','Z']]

          W         X         Z
A -0.080292 -0.820230 -1.653505
B  0.526817  0.253668  0.474805
C  0.126391  0.875807  0.489577
D  0.112413 -0.198816 -0.211515
E -1.083794 -0.056154  0.796913

In [8]:
df['baru'] = df['W'] + df['Y']

In [9]:
df

          W         X         Y         Z      baru
A -0.080292 -0.820230  0.090849 -1.653505  0.010556
B  0.526817  0.253668 -0.717309  0.474805 -0.190492
C  0.126391  0.875807 -0.471635  0.489577 -0.345243
D  0.112413 -0.198816  1.574239 -0.211515  1.686652
E -1.083794 -0.056154 -0.712756  0.796913 -1.796550

In [10]:
df.drop('baru',axis=1) 
# Axis. 0 adalah index 1 colom
# Drop adalah menghapus

          W         X         Y         Z
A -0.080292 -0.820230  0.090849 -1.653505
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515
E -1.083794 -0.056154 -0.712756  0.796913

In [11]:
df

          W         X         Y         Z      baru
A -0.080292 -0.820230  0.090849 -1.653505  0.010556
B  0.526817  0.253668 -0.717309  0.474805 -0.190492
C  0.126391  0.875807 -0.471635  0.489577 -0.345243
D  0.112413 -0.198816  1.574239 -0.211515  1.686652
E -1.083794 -0.056154 -0.712756  0.796913 -1.796550

In [12]:
df.drop('baru',axis=1,inplace=True) # inplace true untuk menghilangkan

In [13]:
df

          W         X         Y         Z
A -0.080292 -0.820230  0.090849 -1.653505
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515
E -1.083794 -0.056154 -0.712756  0.796913

In [14]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.080292 -0.820230  0.090849 -1.653505
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515

In [16]:
df.loc['A']

W   -0.080292
X   -0.820230
Y    0.090849
Z   -1.653505
Name: A, dtype: float64

In [17]:
df.iloc[2]

W    0.126391
X    0.875807
Y   -0.471635
Z    0.489577
Name: C, dtype: float64

In [18]:
df.loc['C','Z']

0.48957718645493864

In [19]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.080292  0.090849
B  0.526817 -0.717309

In [21]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C   True   True  False   True
D   True  False   True  False
E  False  False  False   True

In [22]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  0.090849       NaN
B  0.526817  0.253668       NaN  0.474805
C  0.126391  0.875807       NaN  0.489577
D  0.112413       NaN  1.574239       NaN
E       NaN       NaN       NaN  0.796913

In [23]:
df[df['W']>0]

          W         X         Y         Z
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515

In [24]:
df[df['W']>0]['Y']

B   -0.717309
C   -0.471635
D    1.574239
Name: Y, dtype: float64

In [25]:
df[df['W']>0][['Y','Z']]

          Y         Z
B -0.717309  0.474805
C -0.471635  0.489577
D  1.574239 -0.211515

In [30]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
B  0.526817  0.253668 -0.717309  0.474805
C  0.126391  0.875807 -0.471635  0.489577
D  0.112413 -0.198816  1.574239 -0.211515

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.080292 -0.820230  0.090849 -1.653505
1     B  0.526817  0.253668 -0.717309  0.474805
2     C  0.126391  0.875807 -0.471635  0.489577
3     D  0.112413 -0.198816  1.574239 -0.211515
4     E -1.083794 -0.056154 -0.712756  0.796913

In [32]:
df['kode'] = "INA IND JPN USA RSA".split ()

In [33]:
df

          W         X         Y         Z kode
A -0.080292 -0.820230  0.090849 -1.653505  INA
B  0.526817  0.253668 -0.717309  0.474805  IND
C  0.126391  0.875807 -0.471635  0.489577  JPN
D  0.112413 -0.198816  1.574239 -0.211515  USA
E -1.083794 -0.056154 -0.712756  0.796913  RSA

In [34]:
df.set_index('kode')

             W         X         Y         Z
kode
INA  -0.080292 -0.820230  0.090849 -1.653505
IND   0.526817  0.253668 -0.717309  0.474805
JPN   0.126391  0.875807 -0.471635  0.489577
USA   0.112413 -0.198816  1.574239 -0.211515
RSA  -1.083794 -0.056154 -0.712756  0.796913

In [35]:
df

          W         X         Y         Z kode
A -0.080292 -0.820230  0.090849 -1.653505  INA
B  0.526817  0.253668 -0.717309  0.474805  IND
C  0.126391  0.875807 -0.471635  0.489577  JPN
D  0.112413 -0.198816  1.574239 -0.211515  USA
E -1.083794 -0.056154 -0.712756  0.796913  RSA

In [36]:
df.set_index('kode', inplace=True)

In [37]:
df

             W         X         Y         Z
kode
INA  -0.080292 -0.820230  0.090849 -1.653505
IND   0.526817  0.253668 -0.717309  0.474805
JPN   0.126391  0.875807 -0.471635  0.489577
USA   0.112413 -0.198816  1.574239 -0.211515
RSA  -1.083794 -0.056154 -0.712756  0.796913

In [38]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))

data = pd.MultiIndex.from_tuples(data)

In [39]:
zip (dataLabels,dataValue)

In [40]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [41]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [42]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])

In [43]:
df

             A         B
G1 1 -0.831686  0.571724
   2  1.317806 -0.325792
   3 -0.512526 -0.336490
G2 1 -0.533752 -0.092307
   2  0.441522  1.168232
   3 -0.679221  0.648537

In [44]:
df.loc['G1']

          A         B
1 -0.831686  0.571724
2  1.317806 -0.325792
3 -0.512526 -0.336490

In [46]:
df.loc['G1'].loc[3]

A   -0.512526
B   -0.336490
Name: 3, dtype: float64

In [47]:
df.index.names

FrozenList([None, None])

In [48]:
df.index.names = ['Group','No']

In [49]:
df

                 A         B
Group No
G1    1  -0.831686  0.571724
      2   1.317806 -0.325792
      3  -0.512526 -0.336490
G2    1  -0.533752 -0.092307
      2   0.441522  1.168232
      3  -0.679221  0.648537

In [50]:
df.xs('G1')

           A         B
No
1  -0.831686  0.571724
2   1.317806 -0.325792
3  -0.512526 -0.336490

In [51]:
df.xs(['G2',2])

A    0.441522
B    1.168232
Name: (G2, 2), dtype: float64

In [52]:
df.xs(1,level='No')

              A         B
Group
G1    -0.831686  0.571724
G2    -0.533752 -0.092307